

let text = document.querySelector('.ms')


let unit = {
    'กรัม': 'กรัม',
    'ถ้วยตวง': 'ถ้วยตวง',
    'เม็ด': 'เม็ด',
    'kg': 'kg',
    'กลีบ': 'กลีบ',
}

let note = {
    'สำหรับเจียวหอม': '(สำหรับเจียวหอม) ',
    'สำหรับแช่และปั่นพริก': '(สำหรับแช่และปั่นพริก) ',
    'สำหรับคนที่ไม่ชอบ': '(สำหรับคนที่ไม่ชอบ) ',
    'ไม่จำเป็นต้องใส่': '(ไม่จำเป็นต้องใส่) ',
}


// ผัดไทย
var raw_material = [
    [`น้ำตาลมปิ้ป  480 ${unit.กรัม}`],
    [`น้ำมะขามเปียก 100 ${unit.กรัม}`],
    [`น้ำปลา 60 ${unit.กรัม}`],
    [`ไช้โป้ เคม 45 ${unit.กรัม}`],
    [`ซอสมะเขือเทศ 200 ${unit.กรัม}`],
    [`หอมแดง ซอย 230 ${unit.กรัม}`],
    [`น้ำมันพืช 50 ${unit.กรัม}`],
    [`น้ำเปล่า 1200   ${unit.กรัม}`],
];
// ผัดไทย
for (let item of raw_material) {
    text.innerHTML += "<li>" + item + "<br>";
}
text.innerHTML += "<hr>";


//พาสต้าโหรพา
text.innerHTML += "<h2> สูตรทำซอสเพสโต้ พาสต้าโหรพา</h2>";

var พาสต้าโหรพา = [
    [`ใบโหระพา 1/2 ${unit.kg}`],
    [`กระเทียมจีน 12 ${unit.กลีบ}`],
    [`พริกจินดา เขียว 10 ${unit.เม็ด} ${note.ไม่จำเป็นต้องใส่}${note.สำหรับคนที่ไม่ชอบ}`],
    [`น้ำเปล่า  250-300 ${unit.กรัม}`],
    [`น้ำมันพืช 50 ${unit.กรัม}`],
    [`พาร์เมซานชีส 20 ${unit.กรัม}`],
    [`เกลือ 5 ${unit.กรัม}`],
    [`พริกไทยดำแบบเม็ด 10 ${unit.กรัม}`],
];

for (let item of พาสต้าโหรพา) {
    text.innerHTML += "<li>" + item + "<br>";
}

